[
  {
    "title": "",
    "author": "Justine Calaguas",
    "img": "/assets/bea-img.avif",
    "credits": "",
    "lead": "hello",
    "article": "",
    "references": ""
  },
  {
    "title": "The Rise of MLBB Esports in Southeast Asia",
    "author": "Kian Dela Cruz",
    "img": "/assets/kian-img.webp",
    "credits": "Phil Star Global",
    "lead": "hello",
    "article": [
      "Mobile Legends: Bang Bang (MLBB) is one of the biggest mobile games of today, also a staple within the esports world and certainly a massive game within Southeast Asia. As an avid writer and a student of the game, I was curious about the way MLBB has evolved and why it still appeals to millions. The game’s world championship series, known as the M-Series, has attracted an increasing number of viewers every year. The M2 World Championship in 2020 peaked at three million. By the M5 Championship in 2023, it had more than 5 million viewers. Esports Charts, a site that tracks esports stats, reported those numbers. As Alexey Borisov, the chief of esports editors at Esports Charts, notes, this isn’t the result of an overnight explosion.",
      "Its growth, he said, came from expanding into new territories, increasing the amount of prize money and starting new tournament series. These are the things that have helped MLBB grow into a global esports title.",
      "Southeast Asia plays a big role in this success. The Philippines and Indonesia, in particular, are countries that have contributed a lot to MLBB’s viewership. According to Borisov, Filipino and Indonesian languages are also being acknowledged in the esports scene. Little do we know that Indonesia is behind only English and Chinese, and Filipino appears to be entering in the top 10 soon.",
      "The support for MLBB from fans in Southeast Asia is really amazing. Families and friends often gather to watch the tournaments in these countries. Some streamers, content creators and influencers stream these games and they help build a stronger community. The esports scene in Southeast Asia is, perhaps, one of the most fervent parts of the globe, and that is putting it mildly.",
      "Borisov also pointed out that this is only the beginning. He believes that mobile esports has a lot more room to grow. Some of his predictions were stated in the impersonal passive voice, like “the audience will continue to grow” and “esports is expected to expand into new markets.” These ideas show that more people will likely be involved in MLBB and other mobile games in the future.",
      "In conclusion, MLBB is not an ordinary game. It’s a community, a competition and one that’s becoming increasingly mainstream in Southeast Asia. As students, we can learn how a simple mobile game that started small became a global hit by following trends, involving creators, and building strong regional support."
    ],
    "references": [
      "Lojo, M. (2024, August 19). Mobile Legends sees steady growth in yearly viewership. https://www.philstar.com/about-us/sports/2024/08/19/2378982/mobile-legends-sees-steady-growth-yearly-viewership"
    ]
  },
  {
    "title": "Nosebled to Decline: The Stigma of English Elitism",
    "author": "Phoemela Beatrice Gamboa",
    "img": "/assets/bea-img.avif",
    "credits": "Marc Reil Gepaya",
    "lead": "In a nation rich with languages and brilliant minds, why does the English language seem like a gatekeeper to progress?",
    "article": [
      "Within the raging turmoil of surviving on an ever-progressing global stage, Filipinos have always struggled to keep up. From the desperation of meeting the standards of developing countries to securing even the most basic necessities, the challenge of progress has never been easy.",
      "At the heart of it all is the English language — mandated from grade school to college, taught as a foundation for academic and professional growth. It’s the global standard. A minimum requirement. A survival tool. Yet for many, it’s seen as the language of snobs, the rich, the boastful. Elitist. Intimidating.",
      "And so the question lingers: is fluency in English truly a measure of intelligence or is it just a performance? Maybe even a social accessory?",
      "That debate reignited when a teacher from Northern Samar shared a Facebook post expressing their dismay over the results of a simple spelling quiz that was conducted during their Media and Information Literacy (MIL) class. What should have sparked concern was instead met with viral laughter and disbelief. Senior high school students who are the very youth on the edge of adulthood, struggled to spell even the most basic words.",
      "A telltale decline",
      "“Credit is joh.” One of many answers that made netizens scratch their heads and ask: How did we get here?",
      "At this stage in education, students are expected to be preparing for college, careers, and their lives beyond the classroom. But when they can’t spell the language used in college instruction, in job interviews, and in global forums—we’re forced to face an uncomfortable truth: we are failing them. And not just in spelling.",
      "What many miss in this conversation is how English has quietly become a cultural divide. Speak it well, and you’re labeled “intelligent.” The downside? You’re also “mayabang.” Struggle with it, and you’re “dumb,” but still more “relatable” in a laughable way. The language is no longer just a tool; it’s a status symbol. And worse, it’s one we weaponize against each other.",
      "A gap uncrossed",
      "The raw truth? Fluency has never equaled intellect. The Philippines, known for its richness in languages—from Tagalog to Waray, from Cebuano to Ilocano—intelligence has and will always thrive in all of them. Still, in a world that runs on English, not aligning with the global standard doesn’t make us less smart. Instead, it makes us less heard. And that silence has a cost.",
      "The progress we seek demands action. We need to stop laughing and start realizing that English doesn’t make someone superior nor smarter but neither should our discomfort with it stop us from learning. Because in a world that speaks in one language, being left out of the conversation is more dangerous than getting the spelling wrong."
    ],
    "references": [
      "David, M. K., & Govindasamy, S. (2007). Language and identity: The Filipino experience. In A. B. M. Tsui & J. W. Tollefson (Eds.), Language Policy, Culture, and Identity in Asian Contexts (pp. 21–39). Lawrence Erlbaum Associates.",
      "Department of Education (DepEd). (2023). Bridging Language Gaps: The Mother Tongue-Based Multilingual Education (MTB-MLE) Policy. https://www.deped.gov.ph/mtb-mle/",
      "GMA News. (2025, July 20). Spelling quiz results of senior high school students in Northern Samar spark online debate. https://www.facebook.com/gmanews/posts/1220525406785781/",
      "Gonzalez, A. (1998). The language planning situation in the Philippines. Journal of Multilingual and Multicultural Development, 19(5), 487–525. https://doi.org/10.1080/01434639808666371",
      "PhilNews.ph. (2025, July 18). Teacher disappointed over low spelling quiz scores of Grade 12 students in Northern Samar. https://philnews.ph/2025/07/18/teacher-disappointed-over-low-spelling-quiz-scores-of-grade-12-students/",
      "Tupas, R. (2015). I Was Supposed to Speak English Only: The Myths of Language in the Philippine Education System. In R. Tupas (Ed.), Unequal Englishes: The Politics of Englishes Today (pp. 147–163). Palgrave Macmillan. https://doi.org/10.1057/9781137461223_8",
      "World Bank. (2022). The State of Learning Poverty in the Philippines. https://www.worldbank.org/en/country/philippines/publication/state-of-learning-poverty-in-philippines"
    ]
  },
  {
    "title": "Doctor Doom Takes Center Stage: How Avengers: Doomsday Changes Everything",
    "author": "Josh Danielle Miranda",
    "img": "/assets/josh-img.png",
    "credits": "bgr.com",
    "lead": "In Avengers: Doomsday, alliances are tested, heroes are broken, and a single villain, Doctor Doom, threatens to reshape the MCU in his image.",
    "article": [
      "The Marvel Cinematic Universe is about to face its biggest shake-up yet with Avengers: Doomsday. Unlike the cosmic threats of Thanos or Kang, this time, the danger comes from one of the most brilliant and ruthless minds in the Marvel comics, Doctor Doom. Taking over as the new big bad of the MCU, Victor Von Doom is set to test the Avengers like never before. What makes this even more exciting is that Robert Downey Jr., who once defined the MCU as Tony Stark, will now step into Doom’s infamous mask. This casting twist alone has sent shockwaves through the fandom, as fans wonder how the man who once saved the universe will now play the villain determined to destroy it.",
      "The movie promises to be a massive turning point for Marvel’s Phase Six. Reports suggest that Avengers: Doomsday will explore multiverse incursions, where different realities crash into each other, threatening all of existence. Doctor Doom, known for his genius-level intellect and mastery of both science and magic, is expected to manipulate these events to his advantage. Early rumors even point to Doom seizing control of multiversal technology left behind by Kang, making him an even more unpredictable and dangerous enemy. This means the Avengers will not only face physical battles but also moral dilemmas as the multiverse teeters on collapse.",
      "The film also introduces important new characters who will play major roles in Marvel’s future. Franklin Richards, the son of Reed and Sue Richards from the Fantastic Four, is expected to debut in this movie, hinting at Doom’s deeper connection to the Fantastic Four storyline. With the Fantastic Four officially entering the MCU, Avengers: Doomsday will serve as the bridge that connects Earth’s Mightiest Heroes to Marvel’s First Family. This crossover opens doors for new alliances, but it also raises questions about who can be trusted when the multiverse itself is breaking apart.",
      "Marvel Studios president Kevin Feige has described Phase Six as a “reset” for the MCU, and Avengers: Doomsday seems to be the film that will define this change. With a darker tone, a fan-favorite actor taking on a villainous role, and a storyline that could rewrite the rules of the multiverse, this movie has the potential to rival Avengers: Endgame in scale and emotional impact. If Doom lives up to his comic book reputation, the MCU may never be the same again, because for the first time, the greatest threat to the Avengers might not be a god or a titan, but a man with a plan."
    ],
    "references": [
      "BBC News. (2025, July). Avengers: Doomsday – What we know so far. BBC News. https://www.bbc.com/news/articles/ckrgd7eek09o",
      "Nerdist. (2025). Everything we know about Avengers: Doomsday. Nerdist. https://nerdist.com/article/everything-we-know-about-avengers-doomsday/",
      "Truta, F. (2025, July). Robert Downey Jr.’s Doctor Doom will debut in the MCU before Avengers: Doomsday. BGR. https://www.bgr.com/entertainment/robert-downey-jr-s-doctor-doom-will-debut-in-the-mcu-before-avengers-doomsday/"
    ]
  },
  {
    "title": "Could Max Verstappen Be Leaving Red Bull for Mercedes in 2026?",
    "author": "Hero Park",
    "img": "/assets/park-img.png",
    "credits": "autohebdof1.com",
    "lead": "The four-time Formula 1 world champion Max Verstappen may join Mercedes in 2026 instead of Red Bull Racing, according to rumors circulating in the F1 community.",
    "article": [
      "Red Bull's future with Max Verstappen is in doubt. Although he has a deal with the team until 2028, he is likely to leave for Mercedes in 2026, according to rumors. It is stated that Verstappen's team has already approached Mercedes, and the discussions are getting serious.",
      "This gossip began in the Austrian Grand Prix, where Mercedes team principal Toto Wolff stated that they would welcome Verstappen. Red Bull, however, has not been racing as well as they used to. Verstappen used to win regularly, but he won only four races in the last 26. Due to this, people begin to question if he will remain with the team.",
      "One Sky Italy report stated that Verstappen is \"close\" to agreeing to a contract with Mercedes. But neither Red Bull nor Mercedes has made an official statement. Red Bull team principal Christian Horner labeled the reports \"just noise,\" and Red Bull advisor Helmut Marko stated that there is \"no reason\" for Verstappen to depart.",
      "Nevertheless, Verstappen has said that the coming races will be highly crucial. He told a Dutch newspaper, De Telegraaf, that he would like to observe what happens before taking any decisions. He also stated, \"That big, decent steps can be made by the team.\" This indicates that he is also keeping the future of the team and himself in mind.",
      "Mercedes has not yet confirmed who will drive for them in 2026. George Russell is expected to stay, but Kimi Antonelli’s seat is still open. That could make room for Verstappen if he decides to leave Red Bull.",
      "This would not be the first occasion when Mercedes signed a top driver in the midst of a major regulation overhaul. In 2012, they recruited Lewis Hamilton from McLaren, and he won six world championships for them. New engine regulations are on their way in 2026, and it is thought that Mercedes is more ready for these developments. Red Bull will be producing their own engines for the first time, which can be dangerous.",
      "Verstappen has stated that he will not be leaving Formula 1. He explained, \"There is no question of that; my intention is to last in Formula 1 at least through 2028.\" He explained that he likes driving and being around his team, even though he does not enjoy everything about the F1 scene.",
      "Nevertheless, the team is struggling. Red Bull's second car is not performing well, and Verstappen has collected nearly all of the team's points. There are fans who believe that it would be a good point to begin anew for both parties—perhaps with a different driver or a car better suited for more than one individual.",
      "Nobody is certain yet what Verstappen will do, but the rest of the races this season may make up his mind. One thing is certain: the saga of whether he remains or departs will be one of the biggest talking points of the season."
    ],
    "references": [
      "The Guardian. (2025, July 2). Max Verstappen reportedly in talks with Mercedes over move. https://www.theguardian.com/sport/2025/jul/02/max-verstappen-reportedly-in-talks-with-mercedes-over-move",
      "RacingNews365. (n.d.). Would Max Verstappen leaving Red Bull actually be a good thing? https://racingnews365.com/would-max-verstappen-leaving-red-bull-actually-be-a-good-thing",
      "Smith, J. (2025, June 28). Max Verstappen intends to stay at Red Bull unless ‘strange things’ happen. Autosport. https://www.autosport.com/f1/news/max-verstappen-intends-to-stay-at-red-bull-unless-strange-things-happen/10723609/",
      "AutoHebdoF1. (n.d.). Max Verstappen destined to be champion. https://www.autohebdof1.com/news/f1/max-verstappen-destined-to-be-champion.html"
    ]
  },
  {
    "title": "No Sticker, No Problem: The Controversy on the “Not for Hire” Sticker",
    "author": "Allan Pasion Jr.",
    "img": "/assets/allan-img.png",
    "credits": "Toyota Motor Philippines",
    "lead": "hello",
    "article": [
      "A viral video sparked online involving a Toyota Tamaraw and a traffic officer led to a big misunderstanding of the driver being penalized for not having a “Not for Hire” sticker. The issue left many people with confusion and concern. With this issue, the Metropolitan Manila Development Authority (MMDA) has clarified that private vehicles, especially pickup trucks and cargo carriers, are not required to display such stickers.",

      "MMDA Chair Atty. Romando Artes explained during a press briefing, that the traffic enforcer involved in the incident had made a mistake. The violation cited was colorum, which refers to the unauthorized use of a private vehicle for public transport, not the absence of a “Not for Hire” sticker. Chair Artes stated, “Ang violation po niyan, hindi po ‘not for hire.’ Ang violation po ay colorum,” emphasizing that the enforcer who issued the ticket had misinterpreted the offense of the owner of the private vehicle.",

      "The MMDA also confirmed that there is no policy under Republic Act No. 4136 that mandates a “Not for Hire” sticker on private registered vehicles. While a no ‘Not for Hire’ sign may appear in lists of traffic violations, it will only be applied to vehicles being used as a public transport. The agency clarified that any owner of a private vehicles who do not transport passengers for hire are not subject to this rule.",

      "According to the MMDA, private vehicle owners are under no obligation to display a “Not for Hire” sticker. Choosing to use, or not use, such signage should not result in penalties unless there is proof that the vehicle is being used for illegal passenger transport.",

      "In response to the error made, the MMDA announced that the officer involved would be relieved from duty and will face charges that are appropriate to the mistakes he has made.",

      "In a time where social media can quickly spread misunderstandings, this can serve as a wakeup call for both motorists and traffic enforcers to fully understand traffic regulations and prevent spreading information without knowing the full context of the provided issue.",

      "Rest assured, the issue was caused by a mistake in enforcement, not by any new law or policy. If you own a pickup truck or cargo vehicle, you don’t need to put a “Not for Hire” sticker. You can only be issued a ticket when there is a clear violation of illegal transport."
    ],
    "references": [
      "TopGear Philippines. (2025, July 8). MMDA: ‘Not for hire’ sticker not required on private vehicles.https://www.topgear.com.ph/news/motoring-news/mmda-clarifies-not-for-hire-rule-a6888-20250708"
    ]
  },
  {
    "title": "",
    "author": "Kurt Francis Rivera",
    "img": "/assets/bea-img.avif",
    "credits": "",
    "lead": "hello",
    "article": "",
    "references": ""
  },
  {
    "title": "",
    "author": "Carl Jerome Sigua",
    "img": "/assets/bea-img.avif",
    "credits": "",
    "lead": "hello",
    "article": "",
    "references": ""
  }
]
