[
  {
    "title": "",
    "author": "Justine Calaguas",
    "img": "",
    "credits": "",
    "lead": "",
    "article": "",
    "references": ""
  },
  {
    "title": "",
    "author": "Kian Dela Cruz",
    "img": "",
    "credits": "",
    "lead": "",
    "article": "",
    "references": ""
  },
  {
    "title": "Nosebled to Decline: The Stigma of English Elitism",
    "author": "Phoemela Beatrice Gamboa",
    "img": "/assets/bea-img.avif",
    "credits": "Marc Reil Gepaya",
    "lead": "In a nation rich with languages and brilliant minds, why does the English language seem like a gatekeeper to progress?",
    "article": [
      "Within the raging turmoil of surviving on an ever-progressing global stage, Filipinos have always struggled to keep up. From the desperation of meeting the standards of developing countries to securing even the most basic necessities, the challenge of progress has never been easy.",
      "At the heart of it all is the English language — mandated from grade school to college, taught as a foundation for academic and professional growth. It’s the global standard. A minimum requirement. A survival tool. Yet for many, it’s seen as the language of snobs, the rich, the boastful. Elitist. Intimidating.",
      "And so the question lingers: is fluency in English truly a measure of intelligence or is it just a performance? Maybe even a social accessory?",
      "That debate reignited when a teacher from Northern Samar shared a Facebook post expressing their dismay over the results of a simple spelling quiz that was conducted during their Media and Information Literacy (MIL) class. What should have sparked concern was instead met with viral laughter and disbelief. Senior high school students who are the very youth on the edge of adulthood, struggled to spell even the most basic words.",
      "A telltale decline",
      "“Credit is joh.” One of many answers that made netizens scratch their heads and ask: How did we get here?",
      "At this stage in education, students are expected to be preparing for college, careers, and their lives beyond the classroom. But when they can’t spell the language used in college instruction, in job interviews, and in global forums—we’re forced to face an uncomfortable truth: we are failing them. And not just in spelling.",
      "What many miss in this conversation is how English has quietly become a cultural divide. Speak it well, and you’re labeled “intelligent.” The downside? You’re also “mayabang.” Struggle with it, and you’re “dumb,” but still more “relatable” in a laughable way. The language is no longer just a tool; it’s a status symbol. And worse, it’s one we weaponize against each other.",
      "A gap uncrossed",
      "The raw truth? Fluency has never equaled intellect. The Philippines, known for its richness in languages—from Tagalog to Waray, from Cebuano to Ilocano—intelligence has and will always thrive in all of them. Still, in a world that runs on English, not aligning with the global standard doesn’t make us less smart. Instead, it makes us less heard. And that silence has a cost.",
      "The progress we seek demands action. We need to stop laughing and start realizing that English doesn’t make someone superior nor smarter but neither should our discomfort with it stop us from learning. Because in a world that speaks in one language, being left out of the conversation is more dangerous than getting the spelling wrong."
    ],
    "references": [
      "David, M. K., & Govindasamy, S. (2007). Language and identity: The Filipino experience. In A. B. M. Tsui & J. W. Tollefson (Eds.), Language Policy, Culture, and Identity in Asian Contexts (pp. 21–39). Lawrence Erlbaum Associates.",
      "Department of Education (DepEd). (2023). Bridging Language Gaps: The Mother Tongue-Based Multilingual Education (MTB-MLE) Policy. https://www.deped.gov.ph/mtb-mle/",
      "GMA News. (2025, July 20). Spelling quiz results of senior high school students in Northern Samar spark online debate. https://www.facebook.com/gmanews/posts/1220525406785781/",
      "Gonzalez, A. (1998). The language planning situation in the Philippines. Journal of Multilingual and Multicultural Development, 19(5), 487–525. https://doi.org/10.1080/01434639808666371",
      "PhilNews.ph. (2025, July 18). Teacher disappointed over low spelling quiz scores of Grade 12 students in Northern Samar. https://philnews.ph/2025/07/18/teacher-disappointed-over-low-spelling-quiz-scores-of-grade-12-students/",
      "Tupas, R. (2015). I Was Supposed to Speak English Only: The Myths of Language in the Philippine Education System. In R. Tupas (Ed.), Unequal Englishes: The Politics of Englishes Today (pp. 147–163). Palgrave Macmillan. https://doi.org/10.1057/9781137461223_8",
      "World Bank. (2022). The State of Learning Poverty in the Philippines. https://www.worldbank.org/en/country/philippines/publication/state-of-learning-poverty-in-philippines"
    ]
  },
  {
    "title": "",
    "author": "Josh Danielle Miranda",
    "img": "",
    "credits": "",
    "lead": "",
    "article": "",
    "references": ""
  },
  {
    "title": "",
    "author": "Hero Park",
    "img": "",
    "credits": "",
    "lead": "",
    "article": "",
    "references": ""
  },
  {
    "title": "",
    "author": "Allan Pasion Jr.",
    "img": "",
    "credits": "",
    "lead": "",
    "article": "",
    "references": ""
  },
  {
    "title": "",
    "author": "Kurt Francis Rivera",
    "img": "",
    "credits": "",
    "lead": "",
    "article": "",
    "references": ""
  },
  {
    "title": "",
    "author": "Carl Jerome Sigua",
    "img": "",
    "credits": "",
    "lead": "",
    "article": "",
    "references": ""
  }
]
